; ModuleID = 'libstm32f4.a'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct.NVIC_InitTypeDef = type { i8, i8, i8, i32 }
%struct.DMA_Stream_TypeDef = type { i32, i32, i32, i32, i32, i32 }
%struct.DMA_InitTypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.DMA_TypeDef = type { i32, i32, i32, i32 }
%struct.ADC_TypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ADC_InitTypeDef = type { i32, i32, i32, i32, i32, i32, i8 }
%struct.CAN_TypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, [88 x i32], [3 x %struct.DMA_TypeDef], [2 x %struct.DMA_TypeDef], [12 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [8 x i32], [28 x %struct.CAN_FilterRegister_TypeDef] }
%struct.CAN_FilterRegister_TypeDef = type { i32, i32 }
%struct.CAN_InitTypeDef = type { i16, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32 }
%struct.CAN_FilterInitTypeDef = type { i16, i16, i16, i16, i16, i8, i8, i8, i32 }
%struct.CanTxMsg = type { i32, i32, i8, i8, i8, [8 x i8] }
%struct.CanRxMsg = type { i32, i32, i8, i8, i8, [8 x i8], i8 }
%struct.RTC_InitTypeDef = type { i32, i32, i32 }
%struct.RTC_TimeTypeDef = type { i8, i8, i8, i8 }
%struct.RTC_AlarmTypeDef = type { %struct.RTC_TimeTypeDef, i32, i32, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "APBAHBPrescTable", scope: !2, file: !3, line: 128, type: !68, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !67, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/peripherals/stm32f4xx_rcc.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!4 = !{!5, !11, !15}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 290, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "inc/stm32f4xx.h", directory: "/home/rvd5542/stm32f4-templates/lib")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "ERROR", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "SUCCESS", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 285, baseType: !7, size: 32, elements: !12)
!12 = !{!13, !14}
!13 = !DIEnumerator(name: "RESET", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "SET", value: 1, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 287, baseType: !7, size: 32, elements: !16)
!16 = !{!17, !18}
!17 = !DIEnumerator(name: "DISABLE", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "ENABLE", value: 1, isUnsigned: true)
!19 = !{!20, !22, !60, !62, !64, !66}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !21, line: 172, baseType: !7)
!21 = !DIFile(filename: "DDS-FUZZ/llvm/lib/clang/11.0.0/include/stdint.h", directory: "/home/rvd5542")
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !6, line: 765, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 733, size: 1088, elements: !25)
!25 = !{!26, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !24, file: !6, line: 735, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !20)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !24, file: !6, line: 736, baseType: !27, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !24, file: !6, line: 737, baseType: !27, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !24, file: !6, line: 738, baseType: !27, size: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !24, file: !6, line: 739, baseType: !27, size: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !24, file: !6, line: 740, baseType: !27, size: 32, offset: 160)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !24, file: !6, line: 741, baseType: !27, size: 32, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !24, file: !6, line: 742, baseType: !20, size: 32, offset: 224)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !24, file: !6, line: 743, baseType: !27, size: 32, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !24, file: !6, line: 744, baseType: !27, size: 32, offset: 288)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !24, file: !6, line: 745, baseType: !38, size: 64, offset: 320)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 64, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 2)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !24, file: !6, line: 746, baseType: !27, size: 32, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !24, file: !6, line: 747, baseType: !27, size: 32, offset: 416)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !24, file: !6, line: 748, baseType: !27, size: 32, offset: 448)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !24, file: !6, line: 749, baseType: !20, size: 32, offset: 480)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !24, file: !6, line: 750, baseType: !27, size: 32, offset: 512)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !24, file: !6, line: 751, baseType: !27, size: 32, offset: 544)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !24, file: !6, line: 752, baseType: !38, size: 64, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !24, file: !6, line: 753, baseType: !27, size: 32, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !24, file: !6, line: 754, baseType: !27, size: 32, offset: 672)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !24, file: !6, line: 755, baseType: !27, size: 32, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !24, file: !6, line: 756, baseType: !20, size: 32, offset: 736)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !24, file: !6, line: 757, baseType: !27, size: 32, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !24, file: !6, line: 758, baseType: !27, size: 32, offset: 800)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !24, file: !6, line: 759, baseType: !38, size: 64, offset: 832)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !24, file: !6, line: 760, baseType: !27, size: 32, offset: 896)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !24, file: !6, line: 761, baseType: !27, size: 32, offset: 928)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !24, file: !6, line: 762, baseType: !38, size: 64, offset: 960)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !24, file: !6, line: 763, baseType: !27, size: 32, offset: 1024)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !24, file: !6, line: 764, baseType: !27, size: 32, offset: 1056)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !21, line: 226, baseType: !61)
!61 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !21, line: 207, baseType: !65)
!65 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!67 = !{!0}
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 128, elements: !70)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!70 = !{!71}
!71 = !DISubrange(count: 16)
!72 = distinct !DICompileUnit(language: DW_LANG_C99, file: !73, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !74, retainedTypes: !75, splitDebugInlining: false, nameTableKind: None)
!73 = !DIFile(filename: "src/peripherals/misc.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!74 = !{!15}
!75 = !{!20, !76, !60, !114, !146}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !78, line: 358, baseType: !79)
!78 = !DIFile(filename: "inc/core/core_cm4.h", directory: "/home/rvd5542/stm32f4-templates/lib")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 335, size: 1120, elements: !80)
!80 = !{!81, !83, !84, !85, !86, !87, !88, !92, !93, !94, !95, !96, !97, !98, !99, !101, !102, !103, !107, !111, !113}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !79, file: !78, line: 337, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !79, file: !78, line: 338, baseType: !27, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !79, file: !78, line: 339, baseType: !27, size: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !79, file: !78, line: 340, baseType: !27, size: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !79, file: !78, line: 341, baseType: !27, size: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !79, file: !78, line: 342, baseType: !27, size: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !79, file: !78, line: 343, baseType: !89, size: 96, offset: 192)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 96, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 12)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !79, file: !78, line: 344, baseType: !27, size: 32, offset: 288)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !79, file: !78, line: 345, baseType: !27, size: 32, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !79, file: !78, line: 346, baseType: !27, size: 32, offset: 352)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !79, file: !78, line: 347, baseType: !27, size: 32, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !79, file: !78, line: 348, baseType: !27, size: 32, offset: 416)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !79, file: !78, line: 349, baseType: !27, size: 32, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !79, file: !78, line: 350, baseType: !27, size: 32, offset: 480)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !79, file: !78, line: 351, baseType: !100, size: 64, offset: 512)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 64, elements: !39)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !79, file: !78, line: 352, baseType: !82, size: 32, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !79, file: !78, line: 353, baseType: !82, size: 32, offset: 608)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !79, file: !78, line: 354, baseType: !104, size: 128, offset: 640)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 128, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 4)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !79, file: !78, line: 355, baseType: !108, size: 160, offset: 768)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 160, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 5)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !79, file: !78, line: 356, baseType: !112, size: 160, offset: 928)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, elements: !109)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !79, file: !78, line: 357, baseType: !27, size: 32, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !78, line: 318, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 303, size: 28704, elements: !117)
!117 = !{!118, !122, !126, !127, !128, !129, !130, !131, !132, !133, !137, !141, !145}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !116, file: !78, line: 305, baseType: !119, size: 256)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 256, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 8)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !116, file: !78, line: 306, baseType: !123, size: 768, offset: 256)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 768, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 24)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !116, file: !78, line: 307, baseType: !119, size: 256, offset: 1024)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !116, file: !78, line: 308, baseType: !123, size: 768, offset: 1280)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !116, file: !78, line: 309, baseType: !119, size: 256, offset: 2048)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !116, file: !78, line: 310, baseType: !123, size: 768, offset: 2304)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !116, file: !78, line: 311, baseType: !119, size: 256, offset: 3072)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !116, file: !78, line: 312, baseType: !123, size: 768, offset: 3328)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !116, file: !78, line: 313, baseType: !119, size: 256, offset: 4096)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !116, file: !78, line: 314, baseType: !134, size: 1792, offset: 4352)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1792, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 56)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !116, file: !78, line: 315, baseType: !138, size: 1920, offset: 6144)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 1920, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 240)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !116, file: !78, line: 316, baseType: !142, size: 20608, offset: 8064)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 20608, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 644)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !116, file: !78, line: 317, baseType: !27, size: 32, offset: 28672)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !78, line: 596, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 590, size: 128, elements: !149)
!149 = !{!150, !151, !152, !153}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !148, file: !78, line: 592, baseType: !27, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !148, file: !78, line: 593, baseType: !27, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !148, file: !78, line: 594, baseType: !27, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !148, file: !78, line: 595, baseType: !82, size: 32, offset: 96)
!154 = distinct !DICompileUnit(language: DW_LANG_C99, file: !155, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !157, splitDebugInlining: false, nameTableKind: None)
!155 = !DIFile(filename: "src/peripherals/stm32f4xx_dma.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!156 = !{!15, !11}
!157 = !{!20, !158, !168, !64}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_Stream_TypeDef", file: !6, line: 479, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 471, size: 192, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !160, file: !6, line: 473, baseType: !27, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "NDTR", scope: !160, file: !6, line: 474, baseType: !27, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "PAR", scope: !160, file: !6, line: 475, baseType: !27, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "M0AR", scope: !160, file: !6, line: 476, baseType: !27, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "M1AR", scope: !160, file: !6, line: 477, baseType: !27, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "FCR", scope: !160, file: !6, line: 478, baseType: !27, size: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_TypeDef", file: !6, line: 487, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 481, size: 128, elements: !171)
!171 = !{!172, !173, !174, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "LISR", scope: !170, file: !6, line: 483, baseType: !27, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "HISR", scope: !170, file: !6, line: 484, baseType: !27, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "LIFCR", scope: !170, file: !6, line: 485, baseType: !27, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "HIFCR", scope: !170, file: !6, line: 486, baseType: !27, size: 32, offset: 96)
!176 = distinct !DICompileUnit(language: DW_LANG_C99, file: !177, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !178, splitDebugInlining: false, nameTableKind: None)
!177 = !DIFile(filename: "src/peripherals/stm32f4xx_adc.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!178 = !{!20, !60, !179, !64, !66}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ADC_Common_TypeDef", file: !6, line: 334, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 328, size: 96, elements: !182)
!182 = !{!183, !184, !185}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !181, file: !6, line: 330, baseType: !27, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !181, file: !6, line: 331, baseType: !27, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "CDR", scope: !181, file: !6, line: 332, baseType: !27, size: 32, offset: 64)
!186 = distinct !DICompileUnit(language: DW_LANG_C99, file: !187, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !188, retainedTypes: !199, splitDebugInlining: false, nameTableKind: None)
!187 = !DIFile(filename: "src/peripherals/stm32f4xx_exti.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!188 = !{!189, !194, !15, !11}
!189 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !190, line: 48, baseType: !7, size: 32, elements: !191)
!190 = !DIFile(filename: "inc/peripherals/stm32f4xx_exti.h", directory: "/home/rvd5542/stm32f4-templates/lib")
!191 = !{!192, !193}
!192 = !DIEnumerator(name: "EXTI_Mode_Interrupt", value: 0, isUnsigned: true)
!193 = !DIEnumerator(name: "EXTI_Mode_Event", value: 4, isUnsigned: true)
!194 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !190, line: 60, baseType: !7, size: 32, elements: !195)
!195 = !{!196, !197, !198}
!196 = !DIEnumerator(name: "EXTI_Trigger_Rising", value: 8, isUnsigned: true)
!197 = !DIEnumerator(name: "EXTI_Trigger_Falling", value: 12, isUnsigned: true)
!198 = !DIEnumerator(name: "EXTI_Trigger_Rising_Falling", value: 16, isUnsigned: true)
!199 = !{!200, !20, !66}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !6, line: 575, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 567, size: 192, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !202, file: !6, line: 569, baseType: !27, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !202, file: !6, line: 570, baseType: !27, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !202, file: !6, line: 571, baseType: !27, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !202, file: !6, line: 572, baseType: !27, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !202, file: !6, line: 573, baseType: !27, size: 32, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !202, file: !6, line: 574, baseType: !27, size: 32, offset: 160)
!210 = distinct !DICompileUnit(language: DW_LANG_C99, file: !211, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !212, splitDebugInlining: false, nameTableKind: None)
!211 = !DIFile(filename: "src/peripherals/stm32f4xx_rng.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!212 = !{!20, !213, !60}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "RNG_TypeDef", file: !6, line: 999, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 994, size: 96, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !215, file: !6, line: 996, baseType: !27, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !215, file: !6, line: 997, baseType: !27, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !215, file: !6, line: 998, baseType: !27, size: 32, offset: 64)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !222, splitDebugInlining: false, nameTableKind: None)
!221 = !DIFile(filename: "src/peripherals/stm32f4xx_can.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!222 = !{!223, !20, !60, !64}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "CAN_TypeDef", file: !6, line: 399, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 375, size: 6400, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !239, !250, !259, !261, !262, !263, !264, !265, !266, !267, !268, !269, !271}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "MCR", scope: !225, file: !6, line: 377, baseType: !27, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "MSR", scope: !225, file: !6, line: 378, baseType: !27, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "TSR", scope: !225, file: !6, line: 379, baseType: !27, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "RF0R", scope: !225, file: !6, line: 380, baseType: !27, size: 32, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "RF1R", scope: !225, file: !6, line: 381, baseType: !27, size: 32, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "IER", scope: !225, file: !6, line: 382, baseType: !27, size: 32, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ESR", scope: !225, file: !6, line: 383, baseType: !27, size: 32, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "BTR", scope: !225, file: !6, line: 384, baseType: !27, size: 32, offset: 224)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !225, file: !6, line: 385, baseType: !236, size: 2816, offset: 256)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 2816, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 88)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sTxMailBox", scope: !225, file: !6, line: 386, baseType: !240, size: 384, offset: 3072)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 384, elements: !248)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "CAN_TxMailBox_TypeDef", file: !6, line: 347, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 341, size: 128, elements: !243)
!243 = !{!244, !245, !246, !247}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "TIR", scope: !242, file: !6, line: 343, baseType: !27, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "TDTR", scope: !242, file: !6, line: 344, baseType: !27, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "TDLR", scope: !242, file: !6, line: 345, baseType: !27, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "TDHR", scope: !242, file: !6, line: 346, baseType: !27, size: 32, offset: 96)
!248 = !{!249}
!249 = !DISubrange(count: 3)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sFIFOMailBox", scope: !225, file: !6, line: 387, baseType: !251, size: 256, offset: 3456)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 256, elements: !39)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "CAN_FIFOMailBox_TypeDef", file: !6, line: 359, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 353, size: 128, elements: !254)
!254 = !{!255, !256, !257, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "RIR", scope: !253, file: !6, line: 355, baseType: !27, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "RDTR", scope: !253, file: !6, line: 356, baseType: !27, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "RDLR", scope: !253, file: !6, line: 357, baseType: !27, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "RDHR", scope: !253, file: !6, line: 358, baseType: !27, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !225, file: !6, line: 388, baseType: !260, size: 384, offset: 3712)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 384, elements: !90)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "FMR", scope: !225, file: !6, line: 389, baseType: !27, size: 32, offset: 4096)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "FM1R", scope: !225, file: !6, line: 390, baseType: !27, size: 32, offset: 4128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !225, file: !6, line: 391, baseType: !20, size: 32, offset: 4160)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "FS1R", scope: !225, file: !6, line: 392, baseType: !27, size: 32, offset: 4192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !225, file: !6, line: 393, baseType: !20, size: 32, offset: 4224)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "FFA1R", scope: !225, file: !6, line: 394, baseType: !27, size: 32, offset: 4256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !225, file: !6, line: 395, baseType: !20, size: 32, offset: 4288)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "FA1R", scope: !225, file: !6, line: 396, baseType: !27, size: 32, offset: 4320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !225, file: !6, line: 397, baseType: !270, size: 256, offset: 4352)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 256, elements: !120)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sFilterRegister", scope: !225, file: !6, line: 398, baseType: !272, size: 1792, offset: 4608)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 1792, elements: !278)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "CAN_FilterRegister_TypeDef", file: !6, line: 369, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 365, size: 64, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "FR1", scope: !274, file: !6, line: 367, baseType: !27, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "FR2", scope: !274, file: !6, line: 368, baseType: !27, size: 32, offset: 32)
!278 = !{!279}
!279 = !DISubrange(count: 28)
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !282, retainedTypes: !294, splitDebugInlining: false, nameTableKind: None)
!281 = !DIFile(filename: "src/peripherals/stm32f4xx_flash.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!282 = !{!15, !11, !283}
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !284, line: 46, baseType: !7, size: 32, elements: !285)
!284 = !DIFile(filename: "inc/peripherals/stm32f4xx_flash.h", directory: "/home/rvd5542/stm32f4-templates/lib")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293}
!286 = !DIEnumerator(name: "FLASH_BUSY", value: 1, isUnsigned: true)
!287 = !DIEnumerator(name: "FLASH_ERROR_PGS", value: 2, isUnsigned: true)
!288 = !DIEnumerator(name: "FLASH_ERROR_PGP", value: 3, isUnsigned: true)
!289 = !DIEnumerator(name: "FLASH_ERROR_PGA", value: 4, isUnsigned: true)
!290 = !DIEnumerator(name: "FLASH_ERROR_WRP", value: 5, isUnsigned: true)
!291 = !DIEnumerator(name: "FLASH_ERROR_PROGRAM", value: 6, isUnsigned: true)
!292 = !DIEnumerator(name: "FLASH_ERROR_OPERATION", value: 7, isUnsigned: true)
!293 = !DIEnumerator(name: "FLASH_COMPLETE", value: 8, isUnsigned: true)
!294 = !{!60, !62, !20, !295, !305, !66, !309, !64}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !6, line: 589, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 581, size: 192, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !297, file: !6, line: 583, baseType: !27, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !297, file: !6, line: 584, baseType: !27, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !297, file: !6, line: 585, baseType: !27, size: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !297, file: !6, line: 586, baseType: !27, size: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !297, file: !6, line: 587, baseType: !27, size: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !297, file: !6, line: 588, baseType: !27, size: 32, offset: 160)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !21, line: 98, baseType: !308)
!308 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !64)
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !313, splitDebugInlining: false, nameTableKind: None)
!312 = !DIFile(filename: "src/peripherals/stm32f4xx_rtc.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!313 = !{!314, !20, !60, !358, !66}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTC_TypeDef", file: !6, line: 813, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 771, size: 1280, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "TR", scope: !316, file: !6, line: 773, baseType: !27, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !316, file: !6, line: 774, baseType: !27, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !316, file: !6, line: 775, baseType: !27, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !316, file: !6, line: 776, baseType: !27, size: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "PRER", scope: !316, file: !6, line: 777, baseType: !27, size: 32, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "WUTR", scope: !316, file: !6, line: 778, baseType: !27, size: 32, offset: 160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "CALIBR", scope: !316, file: !6, line: 779, baseType: !27, size: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ALRMAR", scope: !316, file: !6, line: 780, baseType: !27, size: 32, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ALRMBR", scope: !316, file: !6, line: 781, baseType: !27, size: 32, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "WPR", scope: !316, file: !6, line: 782, baseType: !27, size: 32, offset: 288)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "SSR", scope: !316, file: !6, line: 783, baseType: !27, size: 32, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "SHIFTR", scope: !316, file: !6, line: 784, baseType: !27, size: 32, offset: 352)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "TSTR", scope: !316, file: !6, line: 785, baseType: !27, size: 32, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "TSDR", scope: !316, file: !6, line: 786, baseType: !27, size: 32, offset: 416)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "TSSSR", scope: !316, file: !6, line: 787, baseType: !27, size: 32, offset: 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "CALR", scope: !316, file: !6, line: 788, baseType: !27, size: 32, offset: 480)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "TAFCR", scope: !316, file: !6, line: 789, baseType: !27, size: 32, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ALRMASSR", scope: !316, file: !6, line: 790, baseType: !27, size: 32, offset: 544)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ALRMBSSR", scope: !316, file: !6, line: 791, baseType: !27, size: 32, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !316, file: !6, line: 792, baseType: !20, size: 32, offset: 608)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "BKP0R", scope: !316, file: !6, line: 793, baseType: !27, size: 32, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "BKP1R", scope: !316, file: !6, line: 794, baseType: !27, size: 32, offset: 672)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "BKP2R", scope: !316, file: !6, line: 795, baseType: !27, size: 32, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "BKP3R", scope: !316, file: !6, line: 796, baseType: !27, size: 32, offset: 736)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "BKP4R", scope: !316, file: !6, line: 797, baseType: !27, size: 32, offset: 768)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "BKP5R", scope: !316, file: !6, line: 798, baseType: !27, size: 32, offset: 800)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "BKP6R", scope: !316, file: !6, line: 799, baseType: !27, size: 32, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "BKP7R", scope: !316, file: !6, line: 800, baseType: !27, size: 32, offset: 864)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "BKP8R", scope: !316, file: !6, line: 801, baseType: !27, size: 32, offset: 896)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "BKP9R", scope: !316, file: !6, line: 802, baseType: !27, size: 32, offset: 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "BKP10R", scope: !316, file: !6, line: 803, baseType: !27, size: 32, offset: 960)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "BKP11R", scope: !316, file: !6, line: 804, baseType: !27, size: 32, offset: 992)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "BKP12R", scope: !316, file: !6, line: 805, baseType: !27, size: 32, offset: 1024)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "BKP13R", scope: !316, file: !6, line: 806, baseType: !27, size: 32, offset: 1056)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "BKP14R", scope: !316, file: !6, line: 807, baseType: !27, size: 32, offset: 1088)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "BKP15R", scope: !316, file: !6, line: 808, baseType: !27, size: 32, offset: 1120)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "BKP16R", scope: !316, file: !6, line: 809, baseType: !27, size: 32, offset: 1152)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "BKP17R", scope: !316, file: !6, line: 810, baseType: !27, size: 32, offset: 1184)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "BKP18R", scope: !316, file: !6, line: 811, baseType: !27, size: 32, offset: 1216)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "BKP19R", scope: !316, file: !6, line: 812, baseType: !27, size: 32, offset: 1248)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorStatus", file: !6, line: 290, baseType: !5)
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !361, retainedTypes: !362, splitDebugInlining: false, nameTableKind: None)
!360 = !DIFile(filename: "src/peripherals/stm32f4xx_crc.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!361 = !{}
!362 = !{!60, !363, !20}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRC_TypeDef", file: !6, line: 412, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 405, size: 96, elements: !366)
!366 = !{!367, !368, !369, !370, !371}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !365, file: !6, line: 407, baseType: !27, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !365, file: !6, line: 408, baseType: !63, size: 8, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !365, file: !6, line: 409, baseType: !60, size: 8, offset: 40)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !365, file: !6, line: 410, baseType: !64, size: 16, offset: 48)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !365, file: !6, line: 411, baseType: !27, size: 32, offset: 64)
!372 = distinct !DICompileUnit(language: DW_LANG_C99, file: !373, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !374, splitDebugInlining: false, nameTableKind: None)
!373 = !DIFile(filename: "src/peripherals/stm32f4xx_fsmc.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!374 = !{!20, !375, !380, !388, !398, !408, !64}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSMC_Bank1_TypeDef", file: !6, line: 598, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 595, size: 256, elements: !378)
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "BTCR", scope: !377, file: !6, line: 597, baseType: !119, size: 256)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSMC_Bank1E_TypeDef", file: !6, line: 607, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 604, size: 224, elements: !383)
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "BWTR", scope: !382, file: !6, line: 606, baseType: !385, size: 224)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 224, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 7)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSMC_Bank2_TypeDef", file: !6, line: 621, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 613, size: 192, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "PCR2", scope: !390, file: !6, line: 615, baseType: !27, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "SR2", scope: !390, file: !6, line: 616, baseType: !27, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "PMEM2", scope: !390, file: !6, line: 617, baseType: !27, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "PATT2", scope: !390, file: !6, line: 618, baseType: !27, size: 32, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !390, file: !6, line: 619, baseType: !20, size: 32, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ECCR2", scope: !390, file: !6, line: 620, baseType: !27, size: 32, offset: 160)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSMC_Bank3_TypeDef", file: !6, line: 635, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 627, size: 192, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "PCR3", scope: !400, file: !6, line: 629, baseType: !27, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "SR3", scope: !400, file: !6, line: 630, baseType: !27, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "PMEM3", scope: !400, file: !6, line: 631, baseType: !27, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "PATT3", scope: !400, file: !6, line: 632, baseType: !27, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !400, file: !6, line: 633, baseType: !20, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ECCR3", scope: !400, file: !6, line: 634, baseType: !27, size: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSMC_Bank4_TypeDef", file: !6, line: 648, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 641, size: 160, elements: !411)
!411 = !{!412, !413, !414, !415, !416}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "PCR4", scope: !410, file: !6, line: 643, baseType: !27, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "SR4", scope: !410, file: !6, line: 644, baseType: !27, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "PMEM4", scope: !410, file: !6, line: 645, baseType: !27, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "PATT4", scope: !410, file: !6, line: 646, baseType: !27, size: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "PIO4", scope: !410, file: !6, line: 647, baseType: !27, size: 32, offset: 128)
!417 = distinct !DICompileUnit(language: DW_LANG_C99, file: !418, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !419, splitDebugInlining: false, nameTableKind: None)
!418 = !DIFile(filename: "src/peripherals/stm32f4xx_sdio.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!419 = !{!20, !420, !66, !60}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "SDIO_TypeDef", file: !6, line: 841, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 819, size: 1056, elements: !423)
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !446}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !422, file: !6, line: 821, baseType: !27, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCR", scope: !422, file: !6, line: 822, baseType: !27, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ARG", scope: !422, file: !6, line: 823, baseType: !27, size: 32, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !422, file: !6, line: 824, baseType: !27, size: 32, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "RESPCMD", scope: !422, file: !6, line: 825, baseType: !82, size: 32, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "RESP1", scope: !422, file: !6, line: 826, baseType: !82, size: 32, offset: 160)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "RESP2", scope: !422, file: !6, line: 827, baseType: !82, size: 32, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "RESP3", scope: !422, file: !6, line: 828, baseType: !82, size: 32, offset: 224)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "RESP4", scope: !422, file: !6, line: 829, baseType: !82, size: 32, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "DTIMER", scope: !422, file: !6, line: 830, baseType: !27, size: 32, offset: 288)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "DLEN", scope: !422, file: !6, line: 831, baseType: !27, size: 32, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "DCTRL", scope: !422, file: !6, line: 832, baseType: !27, size: 32, offset: 352)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "DCOUNT", scope: !422, file: !6, line: 833, baseType: !82, size: 32, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "STA", scope: !422, file: !6, line: 834, baseType: !82, size: 32, offset: 416)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ICR", scope: !422, file: !6, line: 835, baseType: !27, size: 32, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "MASK", scope: !422, file: !6, line: 836, baseType: !27, size: 32, offset: 480)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !422, file: !6, line: 837, baseType: !38, size: 64, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "FIFOCNT", scope: !422, file: !6, line: 838, baseType: !82, size: 32, offset: 576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !422, file: !6, line: 839, baseType: !443, size: 416, offset: 608)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 416, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 13)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO", scope: !422, file: !6, line: 840, baseType: !27, size: 32, offset: 1024)
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !449, retainedTypes: !450, splitDebugInlining: false, nameTableKind: None)
!448 = !DIFile(filename: "src/peripherals/stm32f4xx_cryp_aes.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!449 = !{!5, !15, !11}
!450 = !{!20, !64, !451, !60}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !453, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !454, retainedTypes: !481, splitDebugInlining: false, nameTableKind: None)
!453 = !DIFile(filename: "src/peripherals/stm32f4xx_gpio.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!454 = !{!15, !455, !462, !468, !472, !477}
!455 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !456, line: 57, baseType: !7, size: 32, elements: !457)
!456 = !DIFile(filename: "inc/peripherals/stm32f4xx_gpio.h", directory: "/home/rvd5542/stm32f4-templates/lib")
!457 = !{!458, !459, !460, !461}
!458 = !DIEnumerator(name: "GPIO_Mode_IN", value: 0, isUnsigned: true)
!459 = !DIEnumerator(name: "GPIO_Mode_OUT", value: 1, isUnsigned: true)
!460 = !DIEnumerator(name: "GPIO_Mode_AF", value: 2, isUnsigned: true)
!461 = !DIEnumerator(name: "GPIO_Mode_AN", value: 3, isUnsigned: true)
!462 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !456, line: 81, baseType: !7, size: 32, elements: !463)
!463 = !{!464, !465, !466, !467}
!464 = !DIEnumerator(name: "GPIO_Speed_2MHz", value: 0, isUnsigned: true)
!465 = !DIEnumerator(name: "GPIO_Speed_25MHz", value: 1, isUnsigned: true)
!466 = !DIEnumerator(name: "GPIO_Speed_50MHz", value: 2, isUnsigned: true)
!467 = !DIEnumerator(name: "GPIO_Speed_100MHz", value: 3, isUnsigned: true)
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !456, line: 70, baseType: !7, size: 32, elements: !469)
!469 = !{!470, !471}
!470 = !DIEnumerator(name: "GPIO_OType_PP", value: 0, isUnsigned: true)
!471 = !DIEnumerator(name: "GPIO_OType_OD", value: 1, isUnsigned: true)
!472 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !456, line: 94, baseType: !7, size: 32, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIEnumerator(name: "GPIO_PuPd_NOPULL", value: 0, isUnsigned: true)
!475 = !DIEnumerator(name: "GPIO_PuPd_UP", value: 1, isUnsigned: true)
!476 = !DIEnumerator(name: "GPIO_PuPd_DOWN", value: 2, isUnsigned: true)
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !456, line: 106, baseType: !7, size: 32, elements: !478)
!478 = !{!479, !480}
!479 = !DIEnumerator(name: "Bit_RESET", value: 0, isUnsigned: true)
!480 = !DIEnumerator(name: "Bit_SET", value: 1, isUnsigned: true)
!481 = !{!482, !20, !64, !60}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !6, line: 666, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 654, size: 320, elements: !485)
!485 = !{!486, !487, !488, !489, !490, !491, !492, !493, !494, !495}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !484, file: !6, line: 656, baseType: !27, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !484, file: !6, line: 657, baseType: !27, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !484, file: !6, line: 658, baseType: !27, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !484, file: !6, line: 659, baseType: !27, size: 32, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !484, file: !6, line: 660, baseType: !27, size: 32, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !484, file: !6, line: 661, baseType: !27, size: 32, offset: 160)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "BSRRL", scope: !484, file: !6, line: 662, baseType: !310, size: 16, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "BSRRH", scope: !484, file: !6, line: 663, baseType: !310, size: 16, offset: 208)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !484, file: !6, line: 664, baseType: !27, size: 32, offset: 224)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !484, file: !6, line: 665, baseType: !496, size: 64, offset: 256)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, elements: !39)
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !499, splitDebugInlining: false, nameTableKind: None)
!498 = !DIFile(filename: "src/peripherals/stm32f4xx_spi.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!499 = !{!500, !20, !64, !522, !60}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPI_TypeDef", file: !6, line: 867, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 847, size: 288, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !502, file: !6, line: 849, baseType: !310, size: 16)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !502, file: !6, line: 850, baseType: !64, size: 16, offset: 16)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !502, file: !6, line: 851, baseType: !310, size: 16, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !502, file: !6, line: 852, baseType: !64, size: 16, offset: 48)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !502, file: !6, line: 853, baseType: !310, size: 16, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !502, file: !6, line: 854, baseType: !64, size: 16, offset: 80)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !502, file: !6, line: 855, baseType: !310, size: 16, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !502, file: !6, line: 856, baseType: !64, size: 16, offset: 112)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "CRCPR", scope: !502, file: !6, line: 857, baseType: !310, size: 16, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !502, file: !6, line: 858, baseType: !64, size: 16, offset: 144)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RXCRCR", scope: !502, file: !6, line: 859, baseType: !310, size: 16, offset: 160)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !502, file: !6, line: 860, baseType: !64, size: 16, offset: 176)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "TXCRCR", scope: !502, file: !6, line: 861, baseType: !310, size: 16, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !502, file: !6, line: 862, baseType: !64, size: 16, offset: 208)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "I2SCFGR", scope: !502, file: !6, line: 863, baseType: !310, size: 16, offset: 224)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !502, file: !6, line: 864, baseType: !64, size: 16, offset: 240)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "I2SPR", scope: !502, file: !6, line: 865, baseType: !310, size: 16, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !502, file: !6, line: 866, baseType: !64, size: 16, offset: 272)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !6, line: 765, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 733, size: 1088, elements: !525)
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !524, file: !6, line: 735, baseType: !27, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !524, file: !6, line: 736, baseType: !27, size: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !524, file: !6, line: 737, baseType: !27, size: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !524, file: !6, line: 738, baseType: !27, size: 32, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !524, file: !6, line: 739, baseType: !27, size: 32, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !524, file: !6, line: 740, baseType: !27, size: 32, offset: 160)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !524, file: !6, line: 741, baseType: !27, size: 32, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !524, file: !6, line: 742, baseType: !20, size: 32, offset: 224)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !524, file: !6, line: 743, baseType: !27, size: 32, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !524, file: !6, line: 744, baseType: !27, size: 32, offset: 288)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !524, file: !6, line: 745, baseType: !38, size: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !524, file: !6, line: 746, baseType: !27, size: 32, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !524, file: !6, line: 747, baseType: !27, size: 32, offset: 416)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !524, file: !6, line: 748, baseType: !27, size: 32, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !524, file: !6, line: 749, baseType: !20, size: 32, offset: 480)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !524, file: !6, line: 750, baseType: !27, size: 32, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !524, file: !6, line: 751, baseType: !27, size: 32, offset: 544)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !524, file: !6, line: 752, baseType: !38, size: 64, offset: 576)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !524, file: !6, line: 753, baseType: !27, size: 32, offset: 640)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !524, file: !6, line: 754, baseType: !27, size: 32, offset: 672)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !524, file: !6, line: 755, baseType: !27, size: 32, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !524, file: !6, line: 756, baseType: !20, size: 32, offset: 736)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !524, file: !6, line: 757, baseType: !27, size: 32, offset: 768)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !524, file: !6, line: 758, baseType: !27, size: 32, offset: 800)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !524, file: !6, line: 759, baseType: !38, size: 64, offset: 832)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !524, file: !6, line: 760, baseType: !27, size: 32, offset: 896)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !524, file: !6, line: 761, baseType: !27, size: 32, offset: 928)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !524, file: !6, line: 762, baseType: !38, size: 64, offset: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !524, file: !6, line: 763, baseType: !27, size: 32, offset: 1024)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !524, file: !6, line: 764, baseType: !27, size: 32, offset: 1056)
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !558, retainedTypes: !559, splitDebugInlining: false, nameTableKind: None)
!557 = !DIFile(filename: "src/peripherals/stm32f4xx_cryp.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!558 = !{!15, !5, !11}
!559 = !{!20, !560, !64, !60}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYP_TypeDef", file: !6, line: 972, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 950, size: 640, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !562, file: !6, line: 952, baseType: !27, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !562, file: !6, line: 953, baseType: !27, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !562, file: !6, line: 954, baseType: !27, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "DOUT", scope: !562, file: !6, line: 955, baseType: !27, size: 32, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "DMACR", scope: !562, file: !6, line: 956, baseType: !27, size: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "IMSCR", scope: !562, file: !6, line: 957, baseType: !27, size: 32, offset: 160)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "RISR", scope: !562, file: !6, line: 958, baseType: !27, size: 32, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "MISR", scope: !562, file: !6, line: 959, baseType: !27, size: 32, offset: 224)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "K0LR", scope: !562, file: !6, line: 960, baseType: !27, size: 32, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "K0RR", scope: !562, file: !6, line: 961, baseType: !27, size: 32, offset: 288)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "K1LR", scope: !562, file: !6, line: 962, baseType: !27, size: 32, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "K1RR", scope: !562, file: !6, line: 963, baseType: !27, size: 32, offset: 352)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "K2LR", scope: !562, file: !6, line: 964, baseType: !27, size: 32, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "K2RR", scope: !562, file: !6, line: 965, baseType: !27, size: 32, offset: 416)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "K3LR", scope: !562, file: !6, line: 966, baseType: !27, size: 32, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "K3RR", scope: !562, file: !6, line: 967, baseType: !27, size: 32, offset: 480)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "IV0LR", scope: !562, file: !6, line: 968, baseType: !27, size: 32, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "IV0RR", scope: !562, file: !6, line: 969, baseType: !27, size: 32, offset: 544)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "IV1LR", scope: !562, file: !6, line: 970, baseType: !27, size: 32, offset: 576)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "IV1RR", scope: !562, file: !6, line: 971, baseType: !27, size: 32, offset: 608)
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !586, splitDebugInlining: false, nameTableKind: None)
!585 = !DIFile(filename: "src/peripherals/stm32f4xx_hash.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!586 = !{!20, !587, !64, !60}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "HASH_TypeDef", file: !6, line: 988, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 978, size: 3616, elements: !590)
!590 = !{!591, !592, !593, !594, !596, !597, !598, !602}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !589, file: !6, line: 980, baseType: !27, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "DIN", scope: !589, file: !6, line: 981, baseType: !27, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "STR", scope: !589, file: !6, line: 982, baseType: !27, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "HR", scope: !589, file: !6, line: 983, baseType: !595, size: 160, offset: 96)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !109)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !589, file: !6, line: 984, baseType: !27, size: 32, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !589, file: !6, line: 985, baseType: !27, size: 32, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !589, file: !6, line: 986, baseType: !599, size: 1664, offset: 320)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1664, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 52)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !589, file: !6, line: 987, baseType: !603, size: 1632, offset: 1984)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1632, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 51)
!606 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !608, splitDebugInlining: false, nameTableKind: None)
!607 = !DIFile(filename: "src/peripherals/stm32f4xx_syscfg.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!608 = !{!20, !609, !60, !66}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !6, line: 679, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 672, size: 288, elements: !612)
!612 = !{!613, !614, !615, !617, !618}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !611, file: !6, line: 674, baseType: !27, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !611, file: !6, line: 675, baseType: !27, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !611, file: !6, line: 676, baseType: !616, size: 128, offset: 64)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, elements: !105)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !611, file: !6, line: 677, baseType: !38, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !611, file: !6, line: 678, baseType: !27, size: 32, offset: 256)
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !620, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !449, retainedTypes: !621, splitDebugInlining: false, nameTableKind: None)
!620 = !DIFile(filename: "src/peripherals/stm32f4xx_cryp_des.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!621 = !{!20, !60, !64, !451}
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !624, retainedTypes: !625, splitDebugInlining: false, nameTableKind: None)
!623 = !DIFile(filename: "src/peripherals/stm32f4xx_hash_md5.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!624 = !{!5, !11}
!625 = !{!20, !64, !451}
!626 = distinct !DICompileUnit(language: DW_LANG_C99, file: !627, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !628, splitDebugInlining: false, nameTableKind: None)
!627 = !DIFile(filename: "src/peripherals/stm32f4xx_tim.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!628 = !{!629, !20, !64, !66}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIM_TypeDef", file: !6, line: 911, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 873, size: 672, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !631, file: !6, line: 875, baseType: !310, size: 16)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !631, file: !6, line: 876, baseType: !64, size: 16, offset: 16)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !631, file: !6, line: 877, baseType: !310, size: 16, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !631, file: !6, line: 878, baseType: !64, size: 16, offset: 48)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "SMCR", scope: !631, file: !6, line: 879, baseType: !310, size: 16, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !631, file: !6, line: 880, baseType: !64, size: 16, offset: 80)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "DIER", scope: !631, file: !6, line: 881, baseType: !310, size: 16, offset: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !631, file: !6, line: 882, baseType: !64, size: 16, offset: 112)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !631, file: !6, line: 883, baseType: !310, size: 16, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !631, file: !6, line: 884, baseType: !64, size: 16, offset: 144)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "EGR", scope: !631, file: !6, line: 885, baseType: !310, size: 16, offset: 160)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !631, file: !6, line: 886, baseType: !64, size: 16, offset: 176)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "CCMR1", scope: !631, file: !6, line: 887, baseType: !310, size: 16, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !631, file: !6, line: 888, baseType: !64, size: 16, offset: 208)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "CCMR2", scope: !631, file: !6, line: 889, baseType: !310, size: 16, offset: 224)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !631, file: !6, line: 890, baseType: !64, size: 16, offset: 240)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "CCER", scope: !631, file: !6, line: 891, baseType: !310, size: 16, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !631, file: !6, line: 892, baseType: !64, size: 16, offset: 272)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "CNT", scope: !631, file: !6, line: 893, baseType: !27, size: 32, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "PSC", scope: !631, file: !6, line: 894, baseType: !310, size: 16, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !631, file: !6, line: 895, baseType: !64, size: 16, offset: 336)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ARR", scope: !631, file: !6, line: 896, baseType: !27, size: 32, offset: 352)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "RCR", scope: !631, file: !6, line: 897, baseType: !310, size: 16, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !631, file: !6, line: 898, baseType: !64, size: 16, offset: 400)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "CCR1", scope: !631, file: !6, line: 899, baseType: !27, size: 32, offset: 416)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "CCR2", scope: !631, file: !6, line: 900, baseType: !27, size: 32, offset: 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "CCR3", scope: !631, file: !6, line: 901, baseType: !27, size: 32, offset: 480)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "CCR4", scope: !631, file: !6, line: 902, baseType: !27, size: 32, offset: 512)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "BDTR", scope: !631, file: !6, line: 903, baseType: !310, size: 16, offset: 544)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !631, file: !6, line: 904, baseType: !64, size: 16, offset: 560)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "DCR", scope: !631, file: !6, line: 905, baseType: !310, size: 16, offset: 576)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !631, file: !6, line: 906, baseType: !64, size: 16, offset: 592)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "DMAR", scope: !631, file: !6, line: 907, baseType: !310, size: 16, offset: 608)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !631, file: !6, line: 908, baseType: !64, size: 16, offset: 624)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "OR", scope: !631, file: !6, line: 909, baseType: !310, size: 16, offset: 640)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED14", scope: !631, file: !6, line: 910, baseType: !64, size: 16, offset: 656)
!669 = distinct !DICompileUnit(language: DW_LANG_C99, file: !670, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !449, retainedTypes: !621, splitDebugInlining: false, nameTableKind: None)
!670 = !DIFile(filename: "src/peripherals/stm32f4xx_cryp_tdes.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!671 = distinct !DICompileUnit(language: DW_LANG_C99, file: !672, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !624, retainedTypes: !625, splitDebugInlining: false, nameTableKind: None)
!672 = !DIFile(filename: "src/peripherals/stm32f4xx_hash_sha1.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!673 = distinct !DICompileUnit(language: DW_LANG_C99, file: !674, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !675, splitDebugInlining: false, nameTableKind: None)
!674 = !DIFile(filename: "src/peripherals/stm32f4xx_usart.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!675 = !{!676, !20, !64, !60, !66}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "USART_TypeDef", file: !6, line: 933, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 917, size: 224, elements: !679)
!679 = !{!680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !678, file: !6, line: 919, baseType: !310, size: 16)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !678, file: !6, line: 920, baseType: !64, size: 16, offset: 16)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !678, file: !6, line: 921, baseType: !310, size: 16, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !678, file: !6, line: 922, baseType: !64, size: 16, offset: 48)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !678, file: !6, line: 923, baseType: !310, size: 16, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !678, file: !6, line: 924, baseType: !64, size: 16, offset: 80)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !678, file: !6, line: 925, baseType: !310, size: 16, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !678, file: !6, line: 926, baseType: !64, size: 16, offset: 112)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !678, file: !6, line: 927, baseType: !310, size: 16, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !678, file: !6, line: 928, baseType: !64, size: 16, offset: 144)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "CR3", scope: !678, file: !6, line: 929, baseType: !310, size: 16, offset: 160)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !678, file: !6, line: 930, baseType: !64, size: 16, offset: 176)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "GTPR", scope: !678, file: !6, line: 931, baseType: !310, size: 16, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !678, file: !6, line: 932, baseType: !64, size: 16, offset: 208)
!694 = distinct !DICompileUnit(language: DW_LANG_C99, file: !695, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !696, splitDebugInlining: false, nameTableKind: None)
!695 = !DIFile(filename: "src/peripherals/stm32f4xx_dac.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!696 = !{!20, !697, !60, !66, !64}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "DAC_TypeDef", file: !6, line: 434, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 418, size: 448, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !699, file: !6, line: 420, baseType: !27, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "SWTRIGR", scope: !699, file: !6, line: 421, baseType: !27, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "DHR12R1", scope: !699, file: !6, line: 422, baseType: !27, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "DHR12L1", scope: !699, file: !6, line: 423, baseType: !27, size: 32, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "DHR8R1", scope: !699, file: !6, line: 424, baseType: !27, size: 32, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "DHR12R2", scope: !699, file: !6, line: 425, baseType: !27, size: 32, offset: 160)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "DHR12L2", scope: !699, file: !6, line: 426, baseType: !27, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "DHR8R2", scope: !699, file: !6, line: 427, baseType: !27, size: 32, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "DHR12RD", scope: !699, file: !6, line: 428, baseType: !27, size: 32, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "DHR12LD", scope: !699, file: !6, line: 429, baseType: !27, size: 32, offset: 288)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "DHR8RD", scope: !699, file: !6, line: 430, baseType: !27, size: 32, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "DOR1", scope: !699, file: !6, line: 431, baseType: !27, size: 32, offset: 352)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "DOR2", scope: !699, file: !6, line: 432, baseType: !27, size: 32, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !699, file: !6, line: 433, baseType: !27, size: 32, offset: 416)
!715 = distinct !DICompileUnit(language: DW_LANG_C99, file: !716, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !558, retainedTypes: !717, splitDebugInlining: false, nameTableKind: None)
!716 = !DIFile(filename: "src/peripherals/stm32f4xx_i2c.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!717 = !{!718, !20, !64, !60, !309, !66}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2C_TypeDef", file: !6, line: 705, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 685, size: 288, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !720, file: !6, line: 687, baseType: !310, size: 16)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !720, file: !6, line: 688, baseType: !64, size: 16, offset: 16)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !720, file: !6, line: 689, baseType: !310, size: 16, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !720, file: !6, line: 690, baseType: !64, size: 16, offset: 48)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "OAR1", scope: !720, file: !6, line: 691, baseType: !310, size: 16, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !720, file: !6, line: 692, baseType: !64, size: 16, offset: 80)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "OAR2", scope: !720, file: !6, line: 693, baseType: !310, size: 16, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !720, file: !6, line: 694, baseType: !64, size: 16, offset: 112)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !720, file: !6, line: 695, baseType: !310, size: 16, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !720, file: !6, line: 696, baseType: !64, size: 16, offset: 144)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "SR1", scope: !720, file: !6, line: 697, baseType: !310, size: 16, offset: 160)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !720, file: !6, line: 698, baseType: !64, size: 16, offset: 176)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "SR2", scope: !720, file: !6, line: 699, baseType: !310, size: 16, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !720, file: !6, line: 700, baseType: !64, size: 16, offset: 208)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !720, file: !6, line: 701, baseType: !310, size: 16, offset: 224)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !720, file: !6, line: 702, baseType: !64, size: 16, offset: 240)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "TRISE", scope: !720, file: !6, line: 703, baseType: !310, size: 16, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !720, file: !6, line: 704, baseType: !64, size: 16, offset: 272)
!740 = distinct !DICompileUnit(language: DW_LANG_C99, file: !741, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !742, splitDebugInlining: false, nameTableKind: None)
!741 = !DIFile(filename: "src/peripherals/stm32f4xx_wwdg.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!742 = !{!20, !743, !60, !66}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "WWDG_TypeDef", file: !6, line: 944, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 939, size: 96, elements: !746)
!746 = !{!747, !748, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !745, file: !6, line: 941, baseType: !27, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "CFR", scope: !745, file: !6, line: 942, baseType: !27, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !745, file: !6, line: 943, baseType: !27, size: 32, offset: 64)
!750 = distinct !DICompileUnit(language: DW_LANG_C99, file: !751, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !74, retainedTypes: !752, splitDebugInlining: false, nameTableKind: None)
!751 = !DIFile(filename: "src/peripherals/stm32f4xx_dbgmcu.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!752 = !{!753, !20}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBGMCU_TypeDef", file: !6, line: 446, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 440, size: 128, elements: !756)
!756 = !{!757, !758, !759, !760}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "IDCODE", scope: !755, file: !6, line: 442, baseType: !27, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !755, file: !6, line: 443, baseType: !27, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "APB1FZ", scope: !755, file: !6, line: 444, baseType: !27, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "APB2FZ", scope: !755, file: !6, line: 445, baseType: !27, size: 32, offset: 96)
!761 = distinct !DICompileUnit(language: DW_LANG_C99, file: !762, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !763, retainedTypes: !764, splitDebugInlining: false, nameTableKind: None)
!762 = !DIFile(filename: "src/peripherals/stm32f4xx_iwdg.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!763 = !{!11}
!764 = !{!765, !20, !64}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "IWDG_TypeDef", file: !6, line: 717, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 711, size: 128, elements: !768)
!768 = !{!769, !770, !771, !772}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "KR", scope: !767, file: !6, line: 713, baseType: !27, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !767, file: !6, line: 714, baseType: !27, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "RLR", scope: !767, file: !6, line: 715, baseType: !27, size: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !767, file: !6, line: 716, baseType: !27, size: 32, offset: 96)
!773 = distinct !DICompileUnit(language: DW_LANG_C99, file: !774, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !775, splitDebugInlining: false, nameTableKind: None)
!774 = !DIFile(filename: "src/peripherals/stm32f4xx_dcmi.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!775 = !{!776, !20, !64}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCMI_TypeDef", file: !6, line: 465, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 452, size: 352, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !778, file: !6, line: 454, baseType: !27, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !778, file: !6, line: 455, baseType: !27, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "RISR", scope: !778, file: !6, line: 456, baseType: !27, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "IER", scope: !778, file: !6, line: 457, baseType: !27, size: 32, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "MISR", scope: !778, file: !6, line: 458, baseType: !27, size: 32, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ICR", scope: !778, file: !6, line: 459, baseType: !27, size: 32, offset: 160)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ESCR", scope: !778, file: !6, line: 460, baseType: !27, size: 32, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ESUR", scope: !778, file: !6, line: 461, baseType: !27, size: 32, offset: 224)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "CWSTRTR", scope: !778, file: !6, line: 462, baseType: !27, size: 32, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "CWSIZER", scope: !778, file: !6, line: 463, baseType: !27, size: 32, offset: 288)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !778, file: !6, line: 464, baseType: !27, size: 32, offset: 320)
!791 = distinct !DICompileUnit(language: DW_LANG_C99, file: !792, producer: "clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !156, retainedTypes: !793, splitDebugInlining: false, nameTableKind: None)
!792 = !DIFile(filename: "src/peripherals/stm32f4xx_pwr.c", directory: "/home/rvd5542/stm32f4-templates/lib")
!793 = !{!20, !66, !794, !800, !60, !64}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !6, line: 727, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 723, size: 64, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !796, file: !6, line: 725, baseType: !27, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !796, file: !6, line: 726, baseType: !27, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !78, line: 358, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 335, size: 1120, elements: !803)
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !802, file: !78, line: 337, baseType: !82, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !802, file: !78, line: 338, baseType: !27, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !802, file: !78, line: 339, baseType: !27, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !802, file: !78, line: 340, baseType: !27, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !802, file: !78, line: 341, baseType: !27, size: 32, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !802, file: !78, line: 342, baseType: !27, size: 32, offset: 160)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !802, file: !78, line: 343, baseType: !89, size: 96, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !802, file: !78, line: 344, baseType: !27, size: 32, offset: 288)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !802, file: !78, line: 345, baseType: !27, size: 32, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !802, file: !78, line: 346, baseType: !27, size: 32, offset: 352)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !802, file: !78, line: 347, baseType: !27, size: 32, offset: 384)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !802, file: !78, line: 348, baseType: !27, size: 32, offset: 416)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !802, file: !78, line: 349, baseType: !27, size: 32, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !802, file: !78, line: 350, baseType: !27, size: 32, offset: 480)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !802, file: !78, line: 351, baseType: !100, size: 64, offset: 512)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !802, file: !78, line: 352, baseType: !82, size: 32, offset: 576)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !802, file: !78, line: 353, baseType: !82, size: 32, offset: 608)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !802, file: !78, line: 354, baseType: !104, size: 128, offset: 640)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !802, file: !78, line: 355, baseType: !108, size: 160, offset: 768)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !802, file: !78, line: 356, baseType: !112, size: 160, offset: 928)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !802, file: !78, line: 357, baseType: !27, size: 32, offset: 1088)
!825 = !{!"clang version 11.0.0 (https://github.com/llvm/llvm-project.git 0160ad802e899c2922bc9b29564080c22eb0908c)"}
!826 = !{i32 7, !"Dwarf Version", i32 4}
!827 = !{i32 2, !"Debug Info Version", i32 3}
!828 = !{i32 1, !"wchar_size", i32 4}
!829 = !{i32 1, !"min_enum_size", i32 4}
!830 = distinct !DISubprogram(name: "NVIC_PriorityGroupConfig", scope: !73, file: !73, line: 112, type: !831, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !833)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !20}
!833 = !{!834}
!834 = !DILocalVariable(name: "NVIC_PriorityGroup", arg: 1, scope: !830, file: !73, line: 112, type: !20)
!835 = !DILocation(line: 0, scope: !830)
!836 = !DILocation(line: 118, column: 35, scope: !830)
!837 = !DILocation(line: 118, column: 14, scope: !830)
!838 = !{!839, !840, i64 12}
!839 = !{!"", !840, i64 0, !840, i64 4, !840, i64 8, !840, i64 12, !840, i64 16, !840, i64 20, !841, i64 24, !840, i64 36, !840, i64 40, !840, i64 44, !840, i64 48, !840, i64 52, !840, i64 56, !840, i64 60, !841, i64 64, !840, i64 72, !840, i64 76, !841, i64 80, !841, i64 96, !841, i64 116, !840, i64 136}
!840 = !{!"int", !841, i64 0}
!841 = !{!"omnipotent char", !842, i64 0}
!842 = !{!"Simple C/C++ TBAA"}
!843 = !DILocation(line: 119, column: 1, scope: !830)
!844 = distinct !DISubprogram(name: "NVIC_Init", scope: !73, file: !73, line: 130, type: !845, scopeLine: 131, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !857)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !847}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_InitTypeDef", file: !849, line: 68, baseType: !850)
!849 = !DIFile(filename: "inc/peripherals/misc.h", directory: "/home/rvd5542/stm32f4-templates/lib")
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !849, line: 48, size: 64, elements: !851)
!851 = !{!852, !853, !854, !855}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "NVIC_IRQChannel", scope: !850, file: !849, line: 50, baseType: !60, size: 8)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "NVIC_IRQChannelPreemptionPriority", scope: !850, file: !849, line: 55, baseType: !60, size: 8, offset: 8)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "NVIC_IRQChannelSubPriority", scope: !850, file: !849, line: 60, baseType: !60, size: 8, offset: 16)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "NVIC_IRQChannelCmd", scope: !850, file: !849, line: 65, baseType: !856, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionalState", file: !6, line: 287, baseType: !15)
!857 = !{!858, !859, !860, !861}
!858 = !DILocalVariable(name: "NVIC_InitStruct", arg: 1, scope: !844, file: !73, line: 130, type: !847)
!859 = !DILocalVariable(name: "tmppriority", scope: !844, file: !73, line: 132, type: !60)
!860 = !DILocalVariable(name: "tmppre", scope: !844, file: !73, line: 132, type: !60)
!861 = !DILocalVariable(name: "tmpsub", scope: !844, file: !73, line: 132, type: !60)
!862 = !DILocation(line: 0, scope: !844)
!863 = !DILocation(line: 139, column: 24, scope: !864)
!864 = distinct !DILexicalBlock(scope: !844, file: !73, line: 139, column: 7)
!865 = !{!866, !841, i64 4}
!866 = !{!"", !841, i64 0, !841, i64 1, !841, i64 2, !841, i64 4}
!867 = !DILocation(line: 139, column: 43, scope: !864)
!868 = !DILocation(line: 139, column: 7, scope: !844)
!869 = !DILocation(line: 142, column: 35, scope: !870)
!870 = distinct !DILexicalBlock(scope: !864, file: !73, line: 140, column: 3)
!871 = !DILocation(line: 142, column: 61, scope: !870)
!872 = !DILocation(line: 142, column: 19, scope: !870)
!873 = !DILocation(line: 143, column: 14, scope: !870)
!874 = !DILocation(line: 144, column: 21, scope: !870)
!875 = !DILocation(line: 146, column: 36, scope: !870)
!876 = !{!866, !841, i64 1}
!877 = !DILocation(line: 146, column: 19, scope: !870)
!878 = !DILocation(line: 146, column: 73, scope: !870)
!879 = !DILocation(line: 146, column: 70, scope: !870)
!880 = !DILocation(line: 147, column: 48, scope: !870)
!881 = !{!866, !841, i64 2}
!882 = !DILocation(line: 147, column: 21, scope: !870)
!883 = !DILocation(line: 147, column: 17, scope: !870)
!884 = !DILocation(line: 149, column: 31, scope: !870)
!885 = !DILocation(line: 151, column: 31, scope: !870)
!886 = !{!866, !841, i64 0}
!887 = !DILocation(line: 151, column: 5, scope: !870)
!888 = !DILocation(line: 151, column: 48, scope: !870)
!889 = !{!841, !841, i64 0}
!890 = !DILocation(line: 156, column: 3, scope: !870)
!891 = !DILocation(line: 161, column: 43, scope: !892)
!892 = distinct !DILexicalBlock(scope: !864, file: !73, line: 158, column: 3)
!893 = !DILocation(line: 0, scope: !864)
!894 = !{!840, !840, i64 0}
!895 = !DILocation(line: 163, column: 1, scope: !844)
!896 = distinct !DISubprogram(name: "NVIC_SetVectorTable", scope: !73, file: !73, line: 174, type: !897, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !899)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !20, !20}
!899 = !{!900, !901}
!900 = !DILocalVariable(name: "NVIC_VectTab", arg: 1, scope: !896, file: !73, line: 174, type: !20)
!901 = !DILocalVariable(name: "Offset", arg: 2, scope: !896, file: !73, line: 174, type: !20)
!902 = !DILocation(line: 0, scope: !896)
!903 = !DILocation(line: 180, column: 38, scope: !896)
!904 = !DILocation(line: 180, column: 28, scope: !896)
!905 = !DILocation(line: 180, column: 13, scope: !896)
!906 = !{!839, !840, i64 8}
